deMartimprey/STM32F407_TFT_ILI9486/ILI6486/Inc/menu.h
#ifndef __MENU_H
#define __MENU_H

#ifdef STM32F103xE
#include "stm32f1xx_hal.h"
#endif
#ifdef STM32F207xx
#include "stm32f2xx_hal.h"
#endif
#ifdef STM32F429xx
#include "stm32f4xx_hal.h"
#endif
#ifdef STM32F407xx
#include "stm32f4xx_hal.h"
#endif
#include "font10x16.h"
#include "font16x26.h"
#include "global.h"
#include "tools.h"
#include "var.h"

uint8_t add_elem_menu(menu* my_menu, var* my_var);
void fill_one_line_menu(uint8_t* str, var* my_var);
void display_menu(menu *my_menu, uint16_t x_pos, uint16_t y_pos);
void add_line_number(uint8_t* str, uint8_t position);
void fill_string_with_space(uint8_t* str, uint8_t size);
void menu_up(menu *my_menu);
void menu_down(menu *my_menu);
void menu_var_up(menu *my_menu);
void menu_var_down(menu *my_menu);
uint8_t get_pos(menu *my_menu);
uint32_t get_value_current_pos(menu *my_menu);

#endif /* __MENU_H */
